In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('Practical3.csv')

# head(),tail(),describe(),dtypes,count(),shape

In [3]:
print("Print first 5 records")
data.head()

Print first 5 records

   Roll no      Name  Maths  Science  History  English  Social Science
0         1    Alice     80       75       85       90              95
1         2      Bob     70       80       75       85              90
2         3  Charlie     85       90       80       75              70
3         4    David     60       65       70       75              80
4         5      Eve     90       85       95       80              75

In [4]:
print("Print Last 5 records")
data.tail()

Print Last 5 records

    Roll no     Name  Maths  Science  History  English  Social Science
45        46   Tyler     70       75       80       85              90
46        47     Uma     85       90       85       90              85
47        48  Victor     60       65       70       75              80
48        49   Wendy     75       80       85       90              95
49        50  Xavier     70       75       80       85              90

In [5]:
print("descriptive statistics of dataset")
data.describe()

descriptive statistics of dataset

       Roll no       Maths    Science    History    English  Social Science
count  50.00000  50.000000  50.000000  50.000000  50.000000       50.000000
mean   25.50000  73.400000  77.500000  79.900000  83.800000       85.600000
std    14.57738   9.171829   8.704327   6.427778   7.039249        8.727157
min     1.00000  60.000000  65.000000  70.000000  65.000000       60.000000
25%    13.25000  70.000000  75.000000  75.000000  75.000000       80.000000
50%    25.50000  75.000000  77.500000  80.000000  85.000000       85.000000
75%    37.75000  83.750000  80.000000  85.000000  90.000000       90.000000
max    50.00000  90.000000  90.000000  95.000000  90.000000       95.000000

In [6]:
print("data types of each Columns")
data.dtypes

data types of each Columns

Roll no            int64
Name              object
Maths              int64
Science            int64
History            int64
English            int64
Social Science     int64
dtype: object

In [7]:
print("Count non-null value of each columns")
data.count()

Count non-null value of each columns

Roll no           50
Name              50
Maths             50
Science           50
History           50
English           50
Social Science    50
dtype: int64

In [8]:
print("Show number of columns and rows in Dataset")
data.shape

Show number of columns and rows in Dataset

(50, 7)

In [9]:
data['Maths'].describe()

count    50.000000
mean     73.400000
std       9.171829
min      60.000000
25%      70.000000
50%      75.000000
75%      83.750000
max      90.000000
Name: Maths, dtype: float64